# 21. Площадь треугольника
# Площадь треугольника может быть вычислена с использованием следующей формулы, где b – длина основания
# треугольника, а h – его высота: area = b*h/2

# Напишите программу, в которой пользователь сможет вводить значения для переменных b и h, после чего
# на экране будет отображена площадь треугольника с заявленными основанием и высотой.

b = int(input('Введите длину треугольника (см): '))   # Запрашиваем данные от пользователя
h = int(input('Высота треугольника (см): '))

area = b * h / 2     # Вычисляем площадь треугольника по формуле

print('Площадь треугольника равна %i см' % area)    # Выводим результат


# 22. Площадь треугольника (снова)
# В предыдущем упражнении мы вычисляли площадь треугольника при известных длинах его основания и высоты.
# Но можно рассчитать площадь и на основании длин всех трех сторон треугольника. Пусть s1, s2 и s3 – длины
# сторон, а s = (s1 + s2 + s3)/2. Тогда площадь треугольника может быть вычислена по следующей формуле:
# area = √ s * (s - s1) * (s - s2) * (s - s3)

# Разработайте программу, которая будет принимать на вход длины всех трех сторон
# треугольника и выводить его площадь.

from math import sqrt

s1 = float(input('Введите длину первой стороны треугольника (см): '))    # Запрашиваем данные
s2 = float(input('Введите длину первой стороны треугольника (см): '))
s3 = float(input('Введите длину первой стороны треугольника (см): '))

s = (s1 + s2 + s3)/2      # Производим вычисление площади всех сторон 

area = sqrt((s * (s - s1) * (s - s2) * (s - s3)))   # Вычисляем площадь треугольника 

print('Площадь треугольника равна %.1f см' % area)   # Выводим результат 


# 23. Площадь правильного многоугольника
# Многоугольник называется правильным, если все его стороны и углы равны. Площадь такой фигуры можно вычислить
# по следующей формуле, в которой s – длина стороны, а n – количество сторон: area = n*s^2 / 4*tg(pi/n)

# Напишите программу, которая будет запрашивать у пользователя значения переменных s и n и выводить
# на экран площадь правильного многоугольника, построенного на основании этих величин.
