# 21. Площадь треугольника
# Площадь треугольника может быть вычислена с использованием следующей формулы, где b – длина основания
# треугольника, а h – его высота: area = b*h/2

# Напишите программу, в которой пользователь сможет вводить значения для переменных b и h, после чего
# на экране будет отображена площадь треугольника с заявленными основанием и высотой.

b = int(input('Введите длину треугольника (см): '))   # Запрашиваем данные от пользователя
h = int(input('Высота треугольника (см): '))

area = b * h / 2     # Вычисляем площадь треугольника по формуле

print('Площадь треугольника равна %i см' % area)    # Выводим результат

